# Intentionally curated restore set for this machine.
# Keep this focused on the tools and apps that are painful to recreate by hand.

# Dotfiles/bootstrap tooling
brew "chezmoi"
brew "git"
brew "gh"
brew "jq"
brew "wget"

# Shell and terminal workflow
brew "deno"
brew "eza"
brew "navi"
brew "python@3.12"
brew "starship"

# Common development tooling worth restoring on a fresh machine
brew "cocoapods"
brew "docker"
brew "docker-buildx"
brew "docker-compose"

# Apps closely tied to this repo or daily workflow
cask "1password"
cask "alt-tab"
cask "chatgpt"
cask "copilot-cli"
cask "discord"
cask "firefox"
cask "iina"
cask "obsidian"
cask "pocket-casts"
cask "protonvpn"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "signal"
cask "slack"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"
